ЖБИ_УТ11.РасширениеЖБИ/src/DataProcessors/ЖБИ_АРМЛогиста/ЖБИ_АРМЛогиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЖБИ_АРМЛогиста</name>
  <comment>ЖБИ - АРМ Логиста</comment>
</mdclass:DataProcessor>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_РасчетПредварительныхСтавок/ЖБИ_РасчетПредварительныхСтавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_РасчетПредварительныхСтавок</name>
  <comment>ЖБИ - Расчет предварительных ставок</comment>
  <resources>
    <name>Адрес</name>
    <comment>Адрес</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресЗначенияПолей</name>
    <comment>Адрес значения полей</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Расстояние</name>
    <comment>Расстояние, км</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ставка</name>
    <comment>Ставка, руб.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОбновления</name>
    <comment>Дата обновления</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <comment>Регион</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Город</name>
    <comment>Город</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ПунктыНазначенияОтгрузки/ЖБИ_ПунктыНазначенияОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ПунктыНазначенияОтгрузки</name>
  <resources>
    <name>НомерОтгрузки</name>
    <comment>№ отгрузки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Партнер</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктНазначенияОтгрузки</name>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/DataProcessors/ЖБИ_АРМЛогиста/Forms/ФормаЗаполненияПредварительнойСтавкиПоШаблону/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ЗаполнитьРегионПоШаблонуСервер(ДопПараметры, СообщениеОбОшибке)	
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_РасчетПредварительныхСтавок.ПолучитьПустуюТаблицуНаборЗаписей();	
	МакетРегион = Обработки.ЖБИ_АРМЛогиста.ПолучитьМакет("МакетПредварительныхСтавокПоРегионамИГородам");	
	Для Счетчик = 2 По МакетРегион.ВысотаТаблицы Цикл
		
		Регион 	= СокрЛП(МакетРегион.Область(Счетчик, 1, Счетчик, 1).Текст);
		Город 	= СокрЛП(МакетРегион.Область(Счетчик, 2, Счетчик, 2).Текст); 
		
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		НоваяСтр.ПунктОтгрузки 		= ДопПараметры.ПунктОтгрузки;
		НоваяСтр.Регион 			= Регион;
		НоваяСтр.Город 				= Город;
		НоваяСтр.Расстояние 		= 0;
		НоваяСтр.Ставка 			= 0;
		НоваяСтр.Автор 				= Пользователи.ТекущийПользователь();
		НоваяСтр.ДатаОбновления 	= ТекущаяДатаСеанса();		
	КонецЦикла;
	
	РезультатЗаписи = РегистрыСведений.ЖБИ_РасчетПредварительныхСтавок.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибке);
	
	Возврат РезультатЗаписи;
	
КонецФункции

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура КомандаЗаполнитьРегионПоШаблону(Команда)
	
	Текст = "Заполнить для поставщика "+Партнер+" регионы по шаблону?";
	СтруктураПраметров = Новый Структура("ПунктОтгрузки",ПунктОтгрузки);
	СтруктураСобытия = Новый Структура("ИмяСобытия, ДопПараметры","ЗаполнитьРегионПоШаблону",СтруктураПраметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, СтруктураСобытия);
	ПоказатьВопрос(ОписаниеОповещения,Текст,РежимДиалогаВопрос.ДаНет,15);
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктОтгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("РегистрСведений.ЖБИ_ПунктыНазначенияОтгрузки.Форма.ФормаВыбора",
	Новый Структура("Партнер",Партнер),
	ЭтаФорма,,,,
	Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, "ФормаВыбораПунктОтгрузки"));
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения = Новый Структура("СообщениеОбОшибке","");	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
		Если ДополнительныеПараметры.Свойство("ИмяСобытия")
			И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяСобытия) Тогда
			Если ДополнительныеПараметры.ИмяСобытия = "ЗаполнитьРегионПоШаблону" Тогда			
				Если Результат = КодВозвратаДиалога.Нет ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
					Возврат;
				КонецЕсли;	
				ДопПараметры 		= ДополнительныеПараметры.ДопПараметры;
				СообщениеОбОшибки 	= "";
				РезультатЗаписи 	= ЗаполнитьРегионПоШаблонуСервер(ДопПараметры, СообщениеОбОшибки);
				Если Не РезультатЗаписи Тогда 
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибки);
				Иначе 
					ОбщегоНазначенияКлиент.СообщитьПользователю("Регионы для поставщика "+Партнер+" обновлены");
				КонецЕсли;			
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры = "ФормаВыбораПунктОтгрузки" Тогда
		ПунктОтгрузки = Результат;		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
